Revit 2026 API

# YJustification Enumeration

---

The justification of the framing element in Y.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum YJustification
```
```vb
Public Enumeration YJustification
```
```cpp
public enum class YJustification
```
```fsharp
type YJustification
```

| Member name | Value | Description |
| --- | --- | --- |
| Center | 1 | Justification to the geometrical center of the element. |
| Left | 0 | Justification to the left of the element. |
| Origin | 2 | Justification to the origin of the element. |
| Right | 3 | Justification to the right of the element. |

#### Reference

Autodesk.Revit.DB.Structure Namespace